---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CouldNotGenerateReferencesForFamilyInstance
source: html/960baaa4-606c-f1f6-772f-09f8df63c1d5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CouldNotGenerateReferencesForFamilyInstance Property

Could not generate references for Family Instance.

## Syntax (C#)
```csharp
public static FailureDefinitionId CouldNotGenerateReferencesForFamilyInstance { get; }
```